Revit 2026 API

# GridCreate(Document, Line) Method

---

Creates a new grid line.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Grid Create(
	Document document,
	Line line
)
```
```vb
Public Shared Function Create (
	document As Document,
	line As Line
) As Grid
```
```cpp
public:
static Grid^ Create(
	Document^ document,
	Line^ line
)
```
```fsharp
static member Create :
        document : Document *
        line : Line -> Grid
```

#### Parameters

document Document
     The document in which the new instance is created.
line Line
     A line which represents the location of the grid line.

#### Return Value

Grid The newly created grid.

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. -or- The input line is not on a horizontal plane. |
| ArgumentNullException | A non-optional argument was null |

The line should be on a horizontal plane.

#### Reference

Grid Class

Create Overload

Autodesk.Revit.DB Namespace